Revit 2026 API

# ElectricalSystemApparentLoadPhaseB Property

---

The ApparentLoadPhaseB value of the Electrical System.

**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public double ApparentLoadPhaseB { get; }
```
```vb
Public ReadOnly Property ApparentLoadPhaseB As Double
	Get
```
```cpp
public:
property double ApparentLoadPhaseB {
	double get ();
}
```
```fsharp
member ApparentLoadPhaseB : float with get
```

#### Property Value

Double

| Exception | Condition |
| --- | --- |
| InvalidOperationException | This property only available when System Type is Power! |

This property is used to retrieve the ApparentLoadPhaseB value of the Electrical System.

#### Reference

ElectricalSystem Class

Autodesk.Revit.DB.Electrical Namespace